_posts/2021-12-01-coding_advent_calendars.html
---
layout: blogpost
title: Coding themed Advent calendars
tags: programming
---

<p>
Counting down the days to Christmas is a fun tradition, done with everything from chocolate advent calendars, TV shows to now coding themed Advent calendars! Holidays can mean much more than reading coding books, or getting/giving computer/technology inspired presents now!
</p>


<p>
<a href="https://en.wikipedia.org/wiki/Advent_calendar">If you aren't familiar with the concept of Advent calendars, i suggest taking a look at the wiki pedia article</a>.
</p>


<p>
If you have any others you enjoy, feel free to share them in the comments! This post will be very short, as my main objective is just to guide you to other places to have fun at. Hope you enjoy these unique countdowns to the holidays as much as I do! :) 
</p>


<div id="outline-container-org6d86428" class="outline-2">
<h2 id="org6d86428">Advent of Code</h2>
<div class="outline-text-2" id="text-org6d86428">
<p>
<a href="https://adventofcode.com/">Advent of Code</a> has been around for many years now. Each day you are served a story, and with it a task that is best solved by coding. This can be everything from finding the maximum number in a file, to paths in graphs. Might sound boring to some, but it makes for fun programming tasks to sometime twist your brain (and sometimes not). Being part of a small Christmas inspired story feels fun as well!
</p>
</div>
</div>

<div id="outline-container-orgb2b9b4a" class="outline-2">
<h2 id="orgb2b9b4a">Bekk - blog calendar</h2>
<div class="outline-text-2" id="text-orgb2b9b4a">
<p>
Bekk has had a tradition for a few years to make <a href="https://www.bekk.christmas/post/2021">a blog-calendar with daily articles on various subjects</a>. In earlier years there have been several calendars relating to both JavaScript, React, Kotlin, Machine Learning, UX and more. This year it seems like there will still be many different topics each day, but not separate calendars for each topic. I can understand that, but will probably miss the Kotlin calendar! Hope we will still see some entries on Kotlin before Christmas!
</p>


<p>
This one has a few posts in Norwegian, but it seems like a lot of them will be in English as well. Hopefully my international readers can find some fun in it as well! :) 
</p>
</div>
</div>


<div id="outline-container-orgb89e907" class="outline-2">
<h2 id="orgb89e907">KnowIt Julekalender (Norwegian)</h2>
<div class="outline-text-2" id="text-orgb89e907">
<p>
This one is my favorite! Daily small coding tasks, where you give an answer as either a text or number (not unlike <a href="https://projecteuler.net/">Project Euler</a> in that regard). Each day is a separate task with its own text, and not relate to each other. Fun, and not hard to just jump into one even if you missed the earlier ones.  
</p>
</div>
</div>


<div id="outline-container-org80c113e" class="outline-2">
<h2 id="org80c113e">Others in Norwegian?</h2>
<div class="outline-text-2" id="text-org80c113e">
<p>
There are several others in Norwegian as well, and you can <a href="https://www.kode24.no/artikkel/her-er-arets-julekalendere-for-utviklere-jula-2021/74768728">read more about them at Kode24</a> (the Norwegian web based newspaper for software development). I like to keep my blog posts open to an international audience as well, but know that I have some Norwegian readers. The Norwegian ones (like the one from PST ) are often really good! Highly recommended to my Norwegian readers!
</p>
</div>
</div>
